## Plan Result (prod_appgw)




<pre><code>Plan: 4 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_application_gateway.this
  * azurerm_key_vault_access_policy.appgw
  * azurerm_public_ip.this[&#34;crime-portal-public-prod&#34;]
  * azurerm_user_assigned_identity.this




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_application_gateway.this will be created
  + resource "azurerm_application_gateway" "this" {
      + id                          = (known after apply)
      + location                    = "uksouth"
      + name                        = "crime-portal-appgw-prod"
      + private_endpoint_connection = (known after apply)
      + resource_group_name         = "crime-portal-rg-prod"
      + tags                        = {
          + "application"  = "crime-portal"
          + "builtFrom"    = "hmcts/crime-portal-infra"
          + "businessArea" = "cross-cutting"
          + "criticality"  = "High"
          + "environment"  = "production"
          + "startupMode"  = "always"
        }
      + zones                       = [
          + "1",
          + "2",
        ]

      + autoscale_configuration {
          + max_capacity = 10
          + min_capacity = 1
        }

      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.24.246.20",
              + "10.24.246.21",
            ]
          + name         = "crime-portal-bap01-prod"
        }

      + backend_http_settings {
          + cookie_based_affinity               = "Enabled"
          + host_name                           = "crimeportal.apps.hmcts.net"
          + id                                  = (known after apply)
          + name                                = "crime-portal-behttp01-prod"
          + pick_host_name_from_backend_address = false
          + port                                = 80
          + probe_id                            = (known after apply)
          + probe_name                          = "http"
          + protocol                            = "Http"
          + request_timeout                     = 30
          + trusted_root_certificate_names      = []
        }

      + frontend_ip_configuration {
          + id                            = (known after apply)
          + name                          = "crime-portal-private-prod"
          + private_ip_address            = "10.24.246.4"
          + private_ip_address_allocation = "Static"
          + private_link_configuration_id = (known after apply)
          + subnet_id                     = "/subscriptions/17390ec1-5a5e-4a20-afb3-38d8d726ae45/resourceGroups/InternalSpoke-rg/providers/Microsoft.Network/virtualNetworks/vnet-prod-int-01/subnets/crime-portal-gateway-prod"
        }
      + frontend_ip_configuration {
          + id                            = (known after apply)
          + name                          = "crime-portal-public-prod"
          + private_ip_address            = (known after apply)
          + private_ip_address_allocation = "Dynamic"
          + private_link_configuration_id = (known after apply)
          + public_ip_address_id          = (known after apply)
        }

      + frontend_port {
          + id   = (known after apply)
          + name = "http"
          + port = 80
        }
      + frontend_port {
          + id   = (known after apply)
          + name = "https"
          + port = 443
        }

      + gateway_ip_configuration {
          + id        = (known after apply)
          + name      = "crime-portal-gwip01-prod"
          + subnet_id = "/subscriptions/17390ec1-5a5e-4a20-afb3-38d8d726ae45/resourceGroups/InternalSpoke-rg/providers/Microsoft.Network/virtualNetworks/vnet-prod-int-01/subnets/crime-portal-gateway-prod"
        }

      + http_listener {
          + frontend_ip_configuration_id   = (known after apply)
          + frontend_ip_configuration_name = "crime-portal-private-stg"
          + frontend_port_id               = (known after apply)
          + frontend_port_name             = "Http"
          + host_names                     = []
          + id                             = (known after apply)
          + name                           = "crime-portal-http-listener"
          + protocol                       = "Http"
          + ssl_certificate_id             = (known after apply)
          + ssl_profile_id                 = (known after apply)
        }

      + identity {
          + identity_ids = (known after apply)
          + type         = "UserAssigned"
        }

      + probe {
          + id                                        = (known after apply)
          + interval                                  = 20
          + minimum_servers                           = 0
          + name                                      = "http"
          + path                                      = "/"
          + pick_host_name_from_backend_http_settings = true
          + protocol                                  = "Http"
          + timeout                                   = 15
          + unhealthy_threshold                       = 3
        }

      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "crime-portal-bap01-stg"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "crime-portal-behttp01-stg"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "crime-portal-http-listener"
          + id                         = (known after apply)
          + name                       = "crime-portal-http-rule"
          + priority                   = 20
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }

      + rewrite_rule_set {
          + id   = (known after apply)
          + name = "x_fwded_proto"

          + rewrite_rule {
              + name          = "x_fwded_proto"
              + rule_sequence = 100

              + request_header_configuration {
                  + header_name  = "X-Forwarded-Proto"
                  + header_value = "https"
                }
              + request_header_configuration {
                  + header_name  = "X-Forwarded-Port"
                  + header_value = "443"
                }
              + request_header_configuration {
                  + header_name  = "X-Forwarded-For"
                  + header_value = "{var_add_x_forwarded_for_proxy}"
                }
            }
        }

      + sku {
          + name = "Standard_v2"
          + tier = "Standard_v2"
        }
    }

  # azurerm_key_vault_access_policy.appgw will be created
  + resource "azurerm_key_vault_access_policy" "appgw" {
      + id                 = (known after apply)
      + key_vault_id       = "/subscriptions/17390ec1-5a5e-4a20-afb3-38d8d726ae45/resourceGroups/crime-portal-rg-prod/providers/Microsoft.KeyVault/vaults/crime-portal-kv-prod"
      + object_id          = (known after apply)
      + secret_permissions = [
          + "Get",
        ]
      + tenant_id          = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # azurerm_public_ip.this["crime-portal-public-prod"] will be created
  + resource "azurerm_public_ip" "this" {
      + allocation_method       = "Static"
      + ddos_protection_mode    = "VirtualNetworkInherited"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "uksouth"
      + name                    = "crime-portal-appgw-prod-pip"
      + resource_group_name     = "crime-portal-rg-prod"
      + sku                     = "Standard"
      + sku_tier                = "Regional"
      + tags                    = {
          + "application"  = "crime-portal"
          + "builtFrom"    = "hmcts/crime-portal-infra"
          + "businessArea" = "cross-cutting"
          + "criticality"  = "High"
          + "environment"  = "production"
          + "startupMode"  = "always"
        }
      + zones                   = [
          + "1",
          + "2",
          + "3",
        ]
    }

  # azurerm_user_assigned_identity.this will be created
  + resource "azurerm_user_assigned_identity" "this" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = "uksouth"
      + name                = "crime-portal-appgw-prod-identity"
      + principal_id        = (known after apply)
      + resource_group_name = "crime-portal-rg-prod"
      + tags                = {
          + "application"  = "crime-portal"
          + "builtFrom"    = "hmcts/crime-portal-infra"
          + "businessArea" = "cross-cutting"
          + "criticality"  = "High"
          + "environment"  = "production"
          + "startupMode"  = "always"
        }
      + tenant_id           = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":42,"Program":"tfcmt","SHA1":"","Target":"prod_appgw","Vars":{}} -->